Revit 2015 API
PlanarFace.Vector Property
Defining vectors of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public XYZ this[
	int index
] { get; }
Visual Basic
Public ReadOnly Property Vector ( _
	index As Integer _
) As XYZ
	Get
Visual C++
public:
property XYZ^ Vector[int index] {
	XYZ^ get (int index);
}
Parameters
index
Type: System.Int32
See Also
PlanarFace Class
Autodesk.Revit.DB Namespace